io_test/results/run1/fio.log
>>>>>>> Test 1 (10 15 20 1.000000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=2262: Wed Aug 19 17:23:55 2015
  write: io=51942MB, bw=83107KB/s, iops=649, runt=640005msec
    slat (usec): min=46, max=141690, avg=1207.12, stdev=5122.37
    clat (usec): min=0, max=6099.7K, avg=140740.86, stdev=597832.12
     lat (usec): min=47, max=6147.7K, avg=141948.38, stdev=602298.67
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    1], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[    2], 90.00th=[252928], 95.00th=[1011712],
     | 99.00th=[3588096], 99.50th=[4882432], 99.90th=[6127616], 99.95th=[6127616],
     | 99.99th=[6127616]
    bw (KB  /s): min= 2466, max=413773, per=100.00%, avg=84473.89, stdev=110615.01
    lat (usec) : 2=54.23%, 4=31.78%, 10=0.21%, 20=0.05%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.02%, 20=0.17%, 50=0.12%
    lat (msec) : 100=0.05%, 250=3.28%, 500=0.80%, 750=3.70%, 1000=0.53%
    lat (msec) : 2000=3.28%, >=2000=1.74%
  cpu          : usr=0.59%, sys=7.91%, ctx=394371, majf=0, minf=2166
  IO depths    : 1=86.3%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=13.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=415537/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=51942MB, aggrb=83106KB/s, minb=83106KB/s, maxb=83106KB/s, mint=640005msec, maxt=640005msec

Disk stats (read/write):
  rbd4: ios=0/42640, merge=0/1938221, ticks=0/83051432, in_queue=88255808, util=99.28%
>>>>>>> Test 2 (10 15 5 1.000000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=23823: Wed Aug 19 17:51:36 2015
  write: io=66905MB, bw=107047KB/s, iops=836, runt=640004msec
    slat (usec): min=45, max=63708, avg=915.83, stdev=3275.02
    clat (usec): min=0, max=2039.7K, avg=106187.77, stdev=234320.70
     lat (usec): min=45, max=2043.6K, avg=107104.00, stdev=236100.02
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    1], 40.00th=[    1], 50.00th=[    2], 60.00th=[    2],
     | 70.00th=[    2], 80.00th=[254976], 90.00th=[382976], 95.00th=[505856],
     | 99.00th=[1220608], 99.50th=[1794048], 99.90th=[1974272], 99.95th=[1974272],
     | 99.99th=[1990656]
    bw (KB  /s): min= 8074, max=256256, per=100.00%, avg=107639.59, stdev=100692.38
    lat (usec) : 2=43.18%, 4=28.41%, 10=0.22%, 20=0.04%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=0.02%, 20=0.01%, 50=0.01%
    lat (msec) : 100=0.71%, 250=6.10%, 500=15.36%, 750=4.76%, 1000=0.07%
    lat (msec) : 2000=1.07%, >=2000=0.01%
  cpu          : usr=0.79%, sys=9.96%, ctx=431536, majf=0, minf=2223
  IO depths    : 1=71.9%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=28.1%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=535239/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=66905MB, aggrb=107047KB/s, minb=107047KB/s, maxb=107047KB/s, mint=640004msec, maxt=640004msec

Disk stats (read/write):
  rbd4: ios=0/115295, merge=0/5706009, ticks=0/86597584, in_queue=86687988, util=99.28%
>>>>>>> Test 3 (10 15 1 1.000000)job1: (g=0): rw=randwrite, bs=128K-128K/128K-128K/128K-128K, ioengine=libaio, iodepth=128
fio-2.2.9-32-gf02f
Starting 1 process

job1: (groupid=0, jobs=1): err= 0: pid=28623: Wed Aug 19 18:50:30 2015
  write: io=100770MB, bw=161231KB/s, iops=1259, runt=640003msec
    slat (usec): min=44, max=203694, avg=632.44, stdev=3074.31
    clat (usec): min=0, max=9147.6K, avg=74507.82, stdev=318677.87
     lat (usec): min=45, max=9219.6K, avg=75140.60, stdev=321042.64
    clat percentiles (usec):
     |  1.00th=[    1],  5.00th=[    1], 10.00th=[    1], 20.00th=[    1],
     | 30.00th=[    2], 40.00th=[    2], 50.00th=[30336], 60.00th=[41728],
     | 70.00th=[57088], 80.00th=[63744], 90.00th=[80384], 95.00th=[120320],
     | 99.00th=[1531904], 99.50th=[1908736], 99.90th=[5210112], 99.95th=[6586368],
     | 99.99th=[8355840]
    bw (KB  /s): min= 1777, max=2140160, per=100.00%, avg=162460.14, stdev=173037.39
    lat (usec) : 2=21.59%, 4=19.42%, 10=0.16%, 20=0.03%, 50=0.01%
    lat (usec) : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
    lat (msec) : 2=0.01%, 4=0.01%, 10=3.48%, 20=0.13%, 50=21.40%
    lat (msec) : 100=27.82%, 250=2.43%, 500=0.34%, 750=0.80%, 1000=0.75%
    lat (msec) : 2000=1.19%, >=2000=0.45%
  cpu          : usr=1.25%, sys=14.44%, ctx=378569, majf=0, minf=2908
  IO depths    : 1=41.2%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=58.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued    : total=r=0/w=806161/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=128

Run status group 0 (all jobs):
  WRITE: io=100770MB, aggrb=161231KB/s, minb=161231KB/s, maxb=161231KB/s, mint=640003msec, maxt=640003msec

Disk stats (read/write):
  rbd4: ios=0/237882, merge=0/14304865, ticks=0/89463952, in_queue=89696904, util=99.28%